Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 32, 20, 3)]       0         
_________________________________________________________________
cast_to_float32 (CastToFloat (None, 32, 20, 3)         0         
_________________________________________________________________
normalization (Normalization (None, 32, 20, 3)         7         
_________________________________________________________________
conv2d (Conv2D)              (None, 30, 18, 32)        896       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 16, 64)        18496     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 8, 64)         0         
_________________________________________________________________
dropout (Dropout)            (None, 14, 8, 64)         0         
_________________________________________________________________
flatten (Flatten)            (None, 7168)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 7168)              0         
_________________________________________________________________
dense (Dense)                (None, 20)                143380    
_________________________________________________________________
classification_head_1 (Softm (None, 20)                0         
=================================================================
Total params: 162,779
Trainable params: 162,772
Non-trainable params: 7
_________________________________________________________________
